read_verilog syn_out/*.v
hierarchy -check -top top_earlgrey
synth_ice40
write_blif out.blif
